{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "afirmacion",
    "1": "rechazo",
    "2": "solicitud",
    "3": "pregunta",
    "4": "duda"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "afirmacion": 0,
    "duda": 4,
    "pregunta": 3,
    "rechazo": 1,
    "solicitud": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "tokenizer_class": "BertJapaneseTokenizer",
  "transformers_version": "5.12.1",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 32000
}
